Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolycurveHandle
Represents a handle that is represented as a polycurve on the model.
Remarks:
It is advisable to use simpler handles when possible (for example, a Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle) since they are
more lightweight.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolycurveHandle.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IComplexHandle)
Creates an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolycurveHandle class.
nativeHandle: Underlying DM handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolycurveHandle.WrappedHandle
Gets the underlying polycurve handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolycurveHandle.Polycurve
Gets the polycurve that the handle represents.